# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [3]:
path = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users = pd.read_csv(path, delimiter='|')
users.head(2)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043

### Step 4. Discover what is the mean age per occupation

In [4]:
users.groupby('occupation')['age'].agg('mean')

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [4]:
users.head(2)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043

In [48]:
def gender_to_numeric(x):
    if x == 'M':
        return 1
    if x == 'F':
        return 0

In [49]:
users['gender_n'] = users['gender'].apply(lambda row: gender_to_numeric(row))

In [55]:
users.groupby('occupation').apply(lambda gdf: gdf[gdf['gender']=='M'].count()/gdf.count())['gender'].reset_index().rename(columns={'gender':'male_ratio'}).sort_values('male_ratio', ascending = False)

       occupation  male_ratio
2          doctor    1.000000
4        engineer    0.970149
19     technician    0.962963
15        retired    0.928571
14     programmer    0.909091
6       executive    0.906250
17      scientist    0.903226
5   entertainment    0.888889
9          lawyer    0.833333
16       salesman    0.750000
3        educator    0.726316
18        student    0.693878
13          other    0.657143
11      marketing    0.615385
20         writer    0.577778
12           none    0.555556
0   administrator    0.544304
1          artist    0.535714
10      librarian    0.431373
7      healthcare    0.312500
8       homemaker    0.142857

In [31]:
(users
    .groupby('occupation')
    .apply(lambda gdf: 100*gdf[gdf['gender'] == 'M'].count()/gdf.count())['gender']
    .reset_index()
    .rename(columns={'gender':'male_ratio'})
    .sort_values(by='male_ratio', ascending=False)
)

       occupation  male_ratio
2          doctor  100.000000
4        engineer   97.014925
19     technician   96.296296
15        retired   92.857143
14     programmer   90.909091
6       executive   90.625000
17      scientist   90.322581
5   entertainment   88.888889
9          lawyer   83.333333
16       salesman   75.000000
3        educator   72.631579
18        student   69.387755
13          other   65.714286
11      marketing   61.538462
20         writer   57.777778
12           none   55.555556
0   administrator   54.430380
1          artist   53.571429
10      librarian   43.137255
7      healthcare   31.250000
8       homemaker   14.285714

In [24]:
users.groupby('occupation').apply(lambda gdf: gdf[gdf['gender'] == 'M'].count()/gdf.count())['gender'].sort_values(ascending=False).reset_index()

       occupation    gender
0          doctor  1.000000
1        engineer  0.970149
2      technician  0.962963
3         retired  0.928571
4      programmer  0.909091
5       executive  0.906250
6       scientist  0.903226
7   entertainment  0.888889
8          lawyer  0.833333
9        salesman  0.750000
10       educator  0.726316
11        student  0.693878
12          other  0.657143
13      marketing  0.615385
14         writer  0.577778
15           none  0.555556
16  administrator  0.544304
17         artist  0.535714
18      librarian  0.431373
19     healthcare  0.312500
20      homemaker  0.142857

### Step 6. For each occupation, calculate the minimum and maximum ages

In [57]:
users.groupby('occupation')['age'].agg(['min','max']).reset_index()

       occupation  min  max
0   administrator   21   70
1          artist   19   48
2          doctor   28   64
3        educator   23   63
4        engineer   22   70
5   entertainment   15   50
6       executive   22   69
7      healthcare   22   62
8       homemaker   20   50
9          lawyer   21   53
10      librarian   23   69
11      marketing   24   55
12           none   11   55
13          other   13   64
14     programmer   20   63
15        retired   51   73
16       salesman   18   66
17      scientist   23   55
18        student    7   42
19     technician   21   55
20         writer   18   60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [59]:
users.groupby(['occupation', 'gender'])['age'].agg('mean')

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

### Step 8.  For each occupation present the percentage of women and men

In [38]:
percentages = (users
    .groupby('occupation')
    .apply(lambda gdf: 100*gdf[gdf['gender'] == 'M'].count()/gdf.count())['gender']
    .reset_index()
    .rename(columns={'gender':'male_ptg'})
)
percentages['female_ptg']  = 100-percentages['male_ptg']
percentages

       occupation    male_ptg  female_ptg
0   administrator   54.430380   45.569620
1          artist   53.571429   46.428571
2          doctor  100.000000    0.000000
3        educator   72.631579   27.368421
4        engineer   97.014925    2.985075
5   entertainment   88.888889   11.111111
6       executive   90.625000    9.375000
7      healthcare   31.250000   68.750000
8       homemaker   14.285714   85.714286
9          lawyer   83.333333   16.666667
10      librarian   43.137255   56.862745
11      marketing   61.538462   38.461538
12           none   55.555556   44.444444
13          other   65.714286   34.285714
14     programmer   90.909091    9.090909
15        retired   92.857143    7.142857
16       salesman   75.000000   25.000000
17      scientist   90.322581    9.677419
18        student   69.387755   30.612245
19     technician   96.296296    3.703704
20         writer   57.777778   42.222222

In [39]:
gender_ocup = users.groupby(['occupation', 'gender']).agg({'gender': 'count'})
gender_ocup

                      gender
occupation    gender
administrator F           36
              M           43
artist        F           13
              M           15
doctor        M            7
educator      F           26
              M           69
engineer      F            2
              M           65
entertainment F            2
              M           16
executive     F            3
              M           29
healthcare    F           11
              M            5
homemaker     F            6
              M            1
lawyer        F            2
              M           10
librarian     F           29
              M           22
marketing     F           10
              M           16
none          F            4
              M            5
other         F           36
              M           69
programmer    F            6
              M           60
retired       F            1
              M           13
salesman      F            3
              M            9
scientist     F            3
              M           28
student       F           60
              M          136
technician    F            1
              M           26
writer        F           19
              M           26

In [40]:
occup_count = users.groupby(['occupation']).agg('count')
occup_count

               user_id  age  gender  zip_code
occupation
administrator       79   79      79        79
artist              28   28      28        28
doctor               7    7       7         7
educator            95   95      95        95
engineer            67   67      67        67
entertainment       18   18      18        18
executive           32   32      32        32
healthcare          16   16      16        16
homemaker            7    7       7         7
lawyer              12   12      12        12
librarian           51   51      51        51
marketing           26   26      26        26
none                 9    9       9         9
other              105  105     105       105
programmer          66   66      66        66
retired             14   14      14        14
salesman            12   12      12        12
scientist           31   31      31        31
student            196  196     196       196
technician          27   27      27        27
writer              45   45      45        45

In [41]:
occup_gender = gender_ocup.div(occup_count, level = "occupation") * 100
occup_gender

                      age      gender  user_id  zip_code
occupation    gender
administrator F       NaN   45.569620      NaN       NaN
              M       NaN   54.430380      NaN       NaN
artist        F       NaN   46.428571      NaN       NaN
              M       NaN   53.571429      NaN       NaN
doctor        M       NaN  100.000000      NaN       NaN
educator      F       NaN   27.368421      NaN       NaN
              M       NaN   72.631579      NaN       NaN
engineer      F       NaN    2.985075      NaN       NaN
              M       NaN   97.014925      NaN       NaN
entertainment F       NaN   11.111111      NaN       NaN
              M       NaN   88.888889      NaN       NaN
executive     F       NaN    9.375000      NaN       NaN
              M       NaN   90.625000      NaN       NaN
healthcare    F       NaN   68.750000      NaN       NaN
              M       NaN   31.250000      NaN       NaN
homemaker     F       NaN   85.714286      NaN       NaN
              M       NaN   14.285714      NaN       NaN
lawyer        F       NaN   16.666667      NaN       NaN
              M       NaN   83.333333      NaN       NaN
librarian     F       NaN   56.862745      NaN       NaN
              M       NaN   43.137255      NaN       NaN
marketing     F       NaN   38.461538      NaN       NaN
              M       NaN   61.538462      NaN       NaN
none          F       NaN   44.444444      NaN       NaN
              M       NaN   55.555556      NaN       NaN
other         F       NaN   34.285714      NaN       NaN
              M       NaN   65.714286      NaN       NaN
programmer    F       NaN    9.090909      NaN       NaN
              M       NaN   90.909091      NaN       NaN
retired       F       NaN    7.142857      NaN       NaN
              M       NaN   92.857143      NaN       NaN
salesman      F       NaN   25.000000      NaN       NaN
              M       NaN   75.000000      NaN       NaN
scientist     F       NaN    9.677419      NaN       NaN
              M       NaN   90.322581      NaN       NaN
student       F       NaN   30.612245      NaN       NaN
              M       NaN   69.387755      NaN       NaN
technician    F       NaN    3.703704      NaN       NaN
              M       NaN   96.296296      NaN       NaN
writer        F       NaN   42.222222      NaN       NaN
              M       NaN   57.777778      NaN       NaN

In [42]:
occup_gender.loc[: , 'gender']

occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
educator       F          27.368421
               M          72.631579
engineer       F           2.985075
               M          97.014925
entertainment  F          11.111111
               M          88.888889
executive      F           9.375000
               M          90.625000
healthcare     F          68.750000
               M          31.250000
homemaker      F          85.714286
               M          14.285714
lawyer         F          16.666667
               M          83.333333
librarian      F          56.862745
               M          43.137255
marketing      F          38.461538
               M          61.538462
none           F          44.444444
               M          55.555556
other          F          34.285714
               M          65.714286
programmer     F           9.090909
               M          90.909091
retired        F           7.142857
               M          92.857143
salesman       F          25.000000
               M          75.000000
scientist      F           9.677419
               M          90.322581
student        F          30.612245
               M          69.387755
technician     F           3.703704
               M          96.296296
writer         F          42.222222
               M          57.777778
Name: gender, dtype: float64